Tekla Open API Reference for Tekla Structures 2025
Task.AddObjectsToTask Method
 Adds objects to the task.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddObjectsToTask(
	ArrayList ModelObjects
)
Public Function AddObjectsToTask (
	ModelObjects As ArrayList
) As Boolean
Parameters
ModelObjects
Type: System.Collections.ArrayList
An array list of model objects to be added to the task.
Return Value
Type: Boolean
True on success.
Examples
using Tekla.Structures.Model;
using System.Collections;
public class Example
{
       public void Example1()
       {
           // Add beam1 and beam2 into the task.
           Task task = new Task();
           Beam beam1 = new Beam();
           Beam beam2 = new Beam();
           if (task.Insert() &&
               beam1.Insert() &&
               beam2.Insert())
           {
               ArrayList objectsToAdd = new ArrayList();
               objectsToAdd.Add(beam1);
               objectsToAdd.Add(beam2);
               task.AddObjectsToTask(objectsToAdd);
           }
       }
}
See Also
Reference
Task Class
Tekla.Structures.Model Namespace